app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
---
  def index
    reviews = Review.where(product_id: params[:product_id])

INSERT INTO "reviews" ("title", "content", "author", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hey! Say! JUMP"], ["content", "Hey Say! BEST"], ["author", "Hey Say! 7"], ["created_at", "2021-02-25 01:28:23.696720"], ["updated_at", "2021-02-25 01:28:23.696720"], ["product_id", 1]]
---
  def create
    review = Review.new(review_params)
    review.product_id = params[:product_id]

    if review.save

UPDATE "reviews" SET "content" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["content", "Hey Say! WORST"], ["updated_at", "2021-02-25 01:54:14.873921"], ["id", 4]]
---
  def update
    if @review.update(review_params)